org/scala/3-layer-cake.org
#+TITLE: 3 Layer Scala Cake
#+DATE: <2019-03-25 Mon>
#+AUTHOR: Jichao Ouyang
#+MACRO: ruby @@html:<ruby>$1<rt>$2</rt></ruby>@@
#+description: I've been using Free Monad in production for a while, as the projects scale and more members contribute, the boundary of different layer reveal them self more clearly.
#+KEYWORDS: Scala, Free, Monad, MTL, ReaderT

# I've been using Free Monad in production for a while, as the projects scale and more
# members contribute, the boundary of different layer reveal them self more clearly.

# Thanks the summary from [[https://www.parsonsmatt.org/2018/03/22/three_layer_haskell_cake.html][Matt Parsons' 3 layer Haskell Cake]].
# I found my Scala code also happen to fell into these 3 layer cake. 
# # To make the future project has more clear boundary of abstraction, I created [[https://github.com/jcouyang/luci][{{{ruby(鸬鹚,luci)}}}]]
# for better taste of Free Monad effects.

# Here it is the Scala version of Cake, prepare your folk please.

# But before cutting the cake, let's +wash our hands+ describe the most common program.

* The Program
It will read output a log, query a data base, and do the calculation.

#+BEGIN_SRC scala
  val xa = Transactor.fromDriverManager[IO]("org.postgresql.Driver", "jdbc:postgresql:postgres", "postgres")
  def program : Int = {
    val initState = 1
    getLogger.log(s"init state is $initState")
    val valueInDatabase = try{
      sql"select 32".query[Int].unique.transact(xa) unsafeRunSyn ()
    } catch { case _: Throwable => 0}
    initState + valueInDatabase
  }
#+END_SRC

Your real business logic might be fancier, but basically this is the most common case

1. Something to ask
2. Something to write
3. Some effects on dependencies
4. Some error to handle
5. Some business computation

Anyway, this is really awful piece code in production.

First of all, how do you unit test such thing? Oh, wait, maybe not that awful, we just mock =getLogger= and stub it's =log= method
and then mock doobie's =ConnectionIO= and stub =transact= method.

Sounds reasonable, just 2 mocks and 2 stubs.

But think about it, here is just 2 line of effectful operation, count again such effectful code in production,
how many mocks and stub you will need then?

Such way of unit testing is definitely not gonna scale.

Let us refactor in a baby step, with =IO=
* Refactor
