scala/3-layer-cake.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2019-03-27 Wed 02:21 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>3 Layer Scala Cake</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Jichao Ouyang">
<meta name="description" content="I've been using Free Monad in production for a while, as the projects scale and more members contribute, the boundary of different layer reveal them self more clearly."
>
<meta name="keywords" content="Scala, Free, Monad, MTL, ReaderT">
<link rel="icon" href="/favicon.ico">
<meta name="theme-color" content="#ffffff">
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<link rel="stylesheet" href="/style/toc.css"/>
<link rel="stylesheet" href="/style/tufte.css"/>
<link rel="alternate" type="application/rss+xml" title="Jichao Ouyang" href="https://feeds.oyanglul.us/JichaoOuyangsBlog"/>

</head>
<body>
<div id="preamble" class="status">
<!-- Google Tag Manager (noscript) -->
<noscript><iframe src="https://www.googletagmanager.com/ns.html?id=GTM-NJRFJGX"
                  height="0" width="0" style="display:none;visibility:hidden"></iframe></noscript>
<!-- End Google Tag Manager (noscript) -->
<header>
    <a accesskey="h" href="/index.html"> HOME </a> |
    <a href="#" id="edit-in-github">EDIT</a> |
    <a href="https://feeds.oyanglul.us/JichaoOuyangsBlog">RSS</a> |
    <a accesskey="H" href="/jichao.ouyang.html">ABOUT</a> |
    <a href="https://github.com/jcouyang/blog">GITHUB</a>
</header>
</div>
<div id="content">
<header>
<h1 class="title">3 Layer Scala Cake</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgdfab53c">The Program</a></li>
<li><a href="#org042ae9f">Refactor</a>
<ul>
<li><a href="#org7830b64">Take 1: IO</a></li>
<li><a href="#org05ba95f">Take 2: ReaderT Pattern</a></li>
<li><a href="#org9c99081">Retro</a>
<ul>
<li><a href="#orgcbb5496">Imperative</a></li>
<li><a href="#org63493dc">IO</a></li>
<li><a href="#org0d369e0">ReaderT</a></li>
</ul>
</li>
<li><a href="#org2e22b67"><b>Tagless Final</b> is nothing but a fancy name of <b>ReaderT</b></a></li>
</ul>
</li>
<li><a href="#org495c5a4">3 Layer Cake</a>
<ul>
<li><a href="#orgff372b6">The Needs of State</a></li>
<li><a href="#orgbed6c47">MTL</a></li>
<li><a href="#orgc2c1908">Free Monad</a></li>
<li><a href="#org01afbc4">ReaderT + MTL + Free</a>
<ul>
<li><a href="#org1a8b4cd">Layer 3: Business (Free)</a></li>
<li><a href="#orgf0220b3">Layer 2: MTL + Interpreter</a></li>
<li><a href="#orgb0adc77">Layer 1: ReaderT</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orgdfab53c" class="outline-2">
<h2 id="orgdfab53c">The Program</h2>
<div class="outline-text-2" id="text-orgdfab53c">
<p>
It will read output a log, query a data base, and do the calculation.
</p>

<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">xa</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Transactor</span>.fromDriverManager[<span style="font-weight: bold; text-decoration: underline;">IO</span>](<span style="font-style: italic;">"org.postgresql.Driver"</span>, <span style="font-style: italic;">"jdbc:postgresql:postgres"</span>, <span style="font-style: italic;">"postgres"</span>)
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span> <span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Int</span> <span style="font-weight: bold;">=</span> {
  <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">initState</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">1</span>
  getLogger.log(s<span style="font-style: italic;">"init state is </span><span style="font-weight: bold; font-style: italic;">$initState</span><span style="font-style: italic;">"</span>)
  <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">valueInDatabase</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">try</span>{
    sql<span style="font-style: italic;">"select 32"</span>.query[<span style="font-weight: bold; text-decoration: underline;">Int</span>].unique.transact(xa) unsafeRunSyn ()
  } <span style="font-weight: bold;">catch</span> { <span style="font-weight: bold;">case</span> <span style="font-weight: bold;">_:</span> <span style="font-weight: bold; text-decoration: underline;">Throwable</span> <span style="font-weight: bold;">=&gt;</span> <span style="font-weight: bold; text-decoration: underline;">0</span>}
  initState + valueInDatabase
}
</code></pre>

<p>
Your real business logic might be fancier, but basically this is the most common case
</p>

<ol class="org-ol">
<li>Something to ask</li>
<li>Something to write</li>
<li>Some effects on dependencies</li>
<li>Some error to handle</li>
<li>Some business computation</li>
</ol>

<p>
Anyway, this is really awful piece code in production.
</p>

<p>
First of all, how do you unit test such thing? Oh, wait, maybe not that awful, we just mock <code>getLogger</code> and stub it's <code>log</code> method
and then mock doobie's <code>ConnectionIO</code> and stub <code>transact</code> method.
</p>

<p>
Sounds reasonable, just 2 mocks and 2 stubs.
</p>

<p>
But think about it, here is just 2 line of effectful operation, count again such effectful code in production,
how many mocks and stub you will need then?
</p>

<p>
Such way of unit testing is definitely not gonna scale.
</p>

<p>
Let us refactor in a baby step, with <code>IO</code>
</p>
</div>
</div>
