org/scala/3-layer-cake.org
** Take 1: IO
modeling your problem with =IO= is easy, just wrap everything in IO

#+BEGIN_SRC scala
  def program : IO[Int] = for {
    initState <- IO(1)
    _ <- IO(getLogger.log(s"init state is $initState"))
    valueInDatabase <- sql"select 32".query[Int].unique.transact(xa)
      .handleError{_=>0}
  } yield initState + valueInDatabase
#+END_SRC

How the hell this is better than previous one?

Yes and No.

It's not better in the sense of testable, but, it's /Pure/

When we mention something that is Pure, it means that thing is Referential Transparent.

In human words, it means I can do this:

#+BEGIN_SRC scala
val logState = IO(getLogger.log(s"log something"))
def program : IO[Unit] = for {
  _ <- logState
  _ <- logState
  _ <- logState
} yield ()
#+END_SRC

But you can't do:
#+BEGIN_SRC scala
val logState = getLogger.log(s"log something")
def program : Int = {
  logState
  logState
  logState
}
#+END_SRC

Probably not the best example but you should get the idea, that I can place IO anywhere
and that won't change the semantic and behavior of your program.

Fine, let's place those IO else where, so we can inject them into program

#+BEGIN_SRC scala
  def program(getState: IO[Int], log: String => IO[Unit], queryDB: IO[Int]): IO[Int] = for {
    initState <- getState
    _ <- log(s"initState is: $initState")
    valueInDatabase <- queryDB
  } yield initState + valueInDatabase
#+END_SRC

Now it's better, in our test, we could simply test =program= like
#+BEGIN_SRC scala
program(IO(1), (msg: String)=>IO(()), IO(10)) must_== 11
#+END_SRC

To verify our program can do the math.

But still, it won't scale, e.g. we need to query 3 value from db
#+BEGIN_SRC scala
def program(getState: IO[Int], log: String => IO[Unit], queryDB: IO[Int], queryDB2: IO[Int], queryDB3: IO[Int]): IO[Int] = for {
    initState <- getState
    _ <- log(s"initState is: $initState")
    valueInDatabase1 <- queryDB1
    valueInDatabase2 <- queryDB2
    valueInDatabase3 <- queryDB3
  } yield initState + valueInDatabase1 + valueInDatabase2 + valueInDatabase3
#+END_SRC

our program will end up very long parameters

Clearly IO isn't enough for more complex scenario, let's see what we can improve by adding another layer of abstraction

