scala/3-layer-cake.html
<div id="outline-container-org042ae9f" class="outline-2">
<h2 id="org042ae9f">Refactor</h2>
<div class="outline-text-2" id="text-org042ae9f">
</div>
<div id="outline-container-org7830b64" class="outline-3">
<h3 id="org7830b64">Take 1: IO</h3>
<div class="outline-text-3" id="text-org7830b64">
<p>
modeling your problem with <code>IO</code> is easy, just wrap everything in IO
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span> <span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  initState <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(<span style="font-weight: bold; text-decoration: underline;">1</span>)
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(getLogger.log(s<span style="font-style: italic;">"init state is </span><span style="font-weight: bold; font-style: italic;">$initState</span><span style="font-style: italic;">"</span>))
  valueInDatabase <span style="font-weight: bold;">&lt;-</span> sql<span style="font-style: italic;">"select 32"</span>.query[<span style="font-weight: bold; text-decoration: underline;">Int</span>].unique.transact(xa)
    .handleError{<span style="font-weight: bold;">_=&gt;</span><span style="font-weight: bold; text-decoration: underline;">0</span>}
} <span style="font-weight: bold;">yield</span> initState + valueInDatabase
</code></pre>

<p>
How the hell this is better than previous one?
</p>

<p>
Yes and No.
</p>

<p>
It's not better in the sense of testable, but, it's <i>Pure</i>
</p>

<p>
When we mention something that is Pure, it means that thing is Referential Transparent.
</p>

<p>
In human words, it means I can do this:
</p>

<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">logState</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(getLogger.log(s<span style="font-style: italic;">"log something"</span>))
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span> <span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Unit</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> logState
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> logState
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> logState
} <span style="font-weight: bold;">yield</span> ()
</code></pre>

<p>
But you can't do:
</p>
<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">logState</span> <span style="font-weight: bold;">=</span> getLogger.log(s<span style="font-style: italic;">"log something"</span>)
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span> <span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Int</span> <span style="font-weight: bold;">=</span> {
  logState
  logState
  logState
}
</code></pre>

<p>
Probably not the best example but you should get the idea, that I can place IO anywhere
and that won't change the semantic and behavior of your program.
</p>

<p>
Fine, let's place those IO else where, so we can inject them into program
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span>(getState<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>], log<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">=&gt;</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Unit</span>], queryDB<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  initState <span style="font-weight: bold;">&lt;-</span> getState
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> log(s<span style="font-style: italic;">"initState is: </span><span style="font-weight: bold; font-style: italic;">$initState</span><span style="font-style: italic;">"</span>)
  valueInDatabase <span style="font-weight: bold;">&lt;-</span> queryDB
} <span style="font-weight: bold;">yield</span> initState + valueInDatabase
</code></pre>

<p>
Now it's better, in our test, we could simply test <code>program</code> like
</p>
<pre class="code"><code>program(<span style="font-weight: bold; text-decoration: underline;">IO</span>(<span style="font-weight: bold; text-decoration: underline;">1</span>), (msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>)<span style="font-weight: bold;">=&gt;</span><span style="font-weight: bold; text-decoration: underline;">IO</span>(()), <span style="font-weight: bold; text-decoration: underline;">IO</span>(<span style="font-weight: bold; text-decoration: underline;">10</span>)) must_== <span style="font-weight: bold; text-decoration: underline;">11</span>
</code></pre>

<p>
To verify our program can do the math.
</p>

<p>
But still, it won't scale, e.g. we need to query 3 value from db
</p>
<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span>(getState<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>], log<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span> <span style="font-weight: bold;">=&gt;</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Unit</span>], queryDB<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>], queryDB2<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>], queryDB3<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
    initState <span style="font-weight: bold;">&lt;-</span> getState
    <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> log(s<span style="font-style: italic;">"initState is: </span><span style="font-weight: bold; font-style: italic;">$initState</span><span style="font-style: italic;">"</span>)
    valueInDatabase1 <span style="font-weight: bold;">&lt;-</span> queryDB1
    valueInDatabase2 <span style="font-weight: bold;">&lt;-</span> queryDB2
    valueInDatabase3 <span style="font-weight: bold;">&lt;-</span> queryDB3
  } <span style="font-weight: bold;">yield</span> initState + valueInDatabase1 + valueInDatabase2 + valueInDatabase3
</code></pre>

<p>
our program will end up very long parameters
</p>

<p>
Clearly IO isn't enough for more complex scenario, let's see what we can improve by adding another layer of abstraction
</p>
</div>
</div>
