org/scala/3-layer-cake.org
** Take 2: ReaderT Pattern
The problem of Dependent Injection via parameters is limited and not scalable, when your program get bigger,
eventually you will need to have sub programs and then you will find the dependency has to be passed all the way down
to each sub program.

Here's the ReaderT pattern to help.

First we move all dependency out, let's model it as =trait Env=
#+BEGIN_SRC scala
  trait Env{
    val state: Int
    def log(msg: String): IO(Unit)
    def query[A](c: ConnectionIO[A]): IO[A]
  }
#+END_SRC

Then we can move parameters of =program= out as standalone methods:
#+BEGIN_SRC scala
  def log(msg: String): ReaderT[IO, Env, Unit] = for {
    env <- Kleisli.ask[IO, Env]
    _ <- Kleisli.liftF(env.log(msg))
  } yield ()

  def doobieQuery[A](query: ConnectionIO[A]): ReaderT[IO, Env, A] = for {
    env <- Kleisli.ask[IO, Env]
    res <- Kleisli.liftF(env.query(query))
  } yield res
#+END_SRC

These methods just return data type that describe that they need a =Env= but not provided yet,
so you could put it anywhere you want, without knowing where exactly the instance of =Env= is.

Finally, the program, without any parameters!!!

#+BEGIN_SRC scala
  def program: ReaderT[IO, Env, Int] = for {
    env <- Kleisli.ask[IO, Int]
    initState = env.state
    _ <- log(s"initState is: $state")
    valueInDatabase <- doobieQuery(sql"select 32".query[Int].unique)
  } yield initState + valueInDatabase
#+END_SRC

** Retro
Let us retro the evolving progress of the type of =program=

*** Imperative
#+BEGIN_SRC scala
def program: Int
#+END_SRC
I'd name this layer *Bare Metal*. Here only exists raw values, 0 abstraction.

*** IO
#+BEGIN_SRC scala
def program(deps...): IO[Int]
#+END_SRC

Introduce a new layer of abstraction =IO=, and I'd like to name it *VM* layer

It's better than Bare metal, but still low level abstraction.

when we need value, just run the IO layer
#+BEGIN_SRC scala
program(deps...).unsafeRunSync()
#+END_SRC

Effects are now Referential Transparent, but the way to inject and use effects is not scalable.

*** ReaderT

#+BEGIN_SRC scala
def program: ReaderT[IO, Env, Int]
#+END_SRC

=ReaderT[IO, Env, Int]= consists 2 layers, =IO= and =Reader[Env, Int]=, this is the layer of *Functional Programming*

pure business, 0 effect, lazy

#+BEGIN_SRC scala
  program // <- ReaderT[IO, Env, Int]
  .run(new Env{
    val state = 1
    def log(msg: String) = IO(getLogger.log(msg))
    def query[A](c: ConnectionIO[A]) = c.transact(xa)
  }) // <- IO[Int]
  .unsafeRunSync() // <- Int
#+END_SRC

We need to run this layer by layer, first =Reader=, and then =IO=

And the time we run =Reader= can provide all the dependencies.

ReaderT is pretty good "pattern" after all:
- *Pure*: effectful part is factor out of program into Env (Bare Metal), so program can be Pure and RT
- *Modular*: Dependency Injections are happened in Monad context, scalable in sense of easy to break program into smaller sub program
- *Data Type*: since ReaderT is just a Data Type, lots of benefits for free from ReaderT's typeclasses instances, such as =Monoid=, =Applicative=, =MonadError=...

