scala/3-layer-cake.html

<div id="outline-container-org05ba95f" class="outline-3">
<h3 id="org05ba95f">Take 2: ReaderT Pattern</h3>
<div class="outline-text-3" id="text-org05ba95f">
<p>
The problem of Dependent Injection via parameters is limited and not scalable, when your program get bigger,
eventually you will need to have sub programs and then you will find the dependency has to be passed all the way down
to each sub program.
</p>

<p>
Here's the ReaderT pattern to help.
</p>

<p>
First we move all dependency out, let's model it as <code>trait Env</code>
</p>
<pre class="code"><code><span style="font-weight: bold;">trait</span> <span style="font-weight: bold; text-decoration: underline;">Env</span>{
  <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">state</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Int</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>(msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(<span style="font-weight: bold; text-decoration: underline;">Unit</span>)
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">query</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>](c<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>]
}
</code></pre>

<p>
Then we can move parameters of <code>program</code> out as standalone methods:
</p>
<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>(msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>, <span style="font-weight: bold; text-decoration: underline;">Unit</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  env <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>.ask[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>]
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>.liftF(env.log(msg))
} <span style="font-weight: bold;">yield</span> ()

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">doobieQuery</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>](query<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>, <span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  env <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>.ask[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>]
  res <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>.liftF(env.query(query))
} <span style="font-weight: bold;">yield</span> res
</code></pre>

<p>
These methods just return data type that describe that they need a <code>Env</code> but not provided yet,
so you could put it anywhere you want, without knowing where exactly the instance of <code>Env</code> is.
</p>

<p>
Finally, the program, without any parameters!!!
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>, <span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  env <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>.ask[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Int</span>]
  initState <span style="font-weight: bold;">=</span> env.state
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> log(s<span style="font-style: italic;">"initState is: </span><span style="font-weight: bold; font-style: italic;">$state</span><span style="font-style: italic;">"</span>)
  valueInDatabase <span style="font-weight: bold;">&lt;-</span> doobieQuery(sql<span style="font-style: italic;">"select 32"</span>.query[<span style="font-weight: bold; text-decoration: underline;">Int</span>].unique)
} <span style="font-weight: bold;">yield</span> initState + valueInDatabase
</code></pre>
</div>
</div>

<div id="outline-container-org9c99081" class="outline-3">
<h3 id="org9c99081">Retro</h3>
<div class="outline-text-3" id="text-org9c99081">
<p>
Let us retro the evolving progress of the type of <code>program</code>
</p>
</div>

<div id="outline-container-orgcbb5496" class="outline-4">
<h4 id="orgcbb5496">Imperative</h4>
<div class="outline-text-4" id="text-orgcbb5496">
<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Int</span>
</code></pre>
<p>
I'd name this layer <b>Bare Metal</b>. Here only exists raw values, 0 abstraction.
</p>
</div>
</div>

<div id="outline-container-org63493dc" class="outline-4">
<h4 id="org63493dc">IO</h4>
<div class="outline-text-4" id="text-org63493dc">
<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span>(deps...)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>]
</code></pre>

<p>
Introduce a new layer of abstraction <code>IO</code>, and I'd like to name it <b>VM</b> layer
</p>

<p>
It's better than Bare metal, but still low level abstraction.
</p>

<p>
when we need value, just run the IO layer
</p>
<pre class="code"><code>program(deps...).unsafeRunSync()
</code></pre>

<p>
Effects are now Referential Transparent, but the way to inject and use effects is not scalable.
</p>
</div>
</div>

<div id="outline-container-org0d369e0" class="outline-4">
<h4 id="org0d369e0">ReaderT</h4>
<div class="outline-text-4" id="text-org0d369e0">
<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">Env</span>, <span style="font-weight: bold; text-decoration: underline;">Int</span>]
</code></pre>

<p>
<code>ReaderT[IO, Env, Int]</code> consists 2 layers, <code>IO</code> and <code>Reader[Env, Int]</code>, this is the layer of <b>Functional Programming</b>
</p>

<p>
pure business, 0 effect, lazy
</p>

<pre class="code"><code>program <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&lt;- ReaderT[IO, Env, Int]</span>
.run(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Env</span>{
  <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">state</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">1</span>
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>(msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>) <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(getLogger.log(msg))
  <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">query</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>](c<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>]) <span style="font-weight: bold;">=</span> c.transact(xa)
}) <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&lt;- IO[Int]</span>
.unsafeRunSync() <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">&lt;- Int</span>
</code></pre>

<p>
We need to run this layer by layer, first <code>Reader</code>, and then <code>IO</code>
</p>

<p>
And the time we run <code>Reader</code> can provide all the dependencies.
</p>

<p>
ReaderT is pretty good "pattern" after all:
</p>
<ul class="org-ul">
<li><b>Pure</b>: effectful part is factor out of program into Env (Bare Metal), so program can be Pure and RT</li>
<li><b>Modular</b>: Dependency Injections are happened in Monad context, scalable in sense of easy to break program into smaller sub program</li>
<li><b>Data Type</b>: since ReaderT is just a Data Type, lots of benefits for free from ReaderT's typeclasses instances, such as <code>Monoid</code>, <code>Applicative</code>, <code>MonadError</code>&#x2026;</li>
</ul>
</div>
</div>
</div>
