org/scala/3-layer-cake.org
** *Tagless Final* is nothing but a fancy name of *ReaderT*
if we make some type alias for readerT, it's pretty much the same thing as the recent trending "design pattern" - /Tagless Final/
#+BEGIN_SRC scala
  trait AlgInterp[F[_]] {
    val state: F[Int]
    def log(msg: String): F[Unit]
    def query[A](c: ConnectionIO[A]): F[A]
  }

  type Alg[F[_], A] = ReaderT[F, AlgInterp[F], A]

  def state[F[_]]: Alg[F, Int] = Kleisli(_.state)
  def log[F[_]](msg: String): Alg[F, Unit] = Kleisli(_.log(msg))

  def doobieQuery[F[_], A](query: ConnectionIO[A]): Alg[F, A]

  def program[F[_]]: Alg[F, Int] = for {
    env <- state
    _ <- log(s"initState is: $state")
    valueInDatabase <- doobieQuery(sql"select 32".query[Int].unique).handleError{_=>0}
  } yield initState + valueInDatabase

 val interp = new AlgInterp[IO]{
    val state = IO(1)
    def log(msg: String) = IO(getLogger.log(msg))
    def query[A](c: ConnectionIO[A]) = c.transact(xa)
  }
  program[IO].run(interp).unsafeRunSync()
#+END_SRC

If you look close enough, here it actually becomes 3 layers:
- Layer 1: IO (AlgInterp)
- Layer 2: IO ~> Alg (state, log, doobieQuery)
- Layer 3: Alg (program)

both layer 2 and 3 are pure, but the different is,
- Layer 2 is just 1-1 mapping from IO to Alg
- Layer 3 is orchestration of Layer 2 for pure business

* 3 Layer Cake
We now have a solid 3 Layer Scala Cake base made of =ReaderT=

But you know, single flavor of cake won't satisfy everyone's taste.

