scala/3-layer-cake.html

<div id="outline-container-org2e22b67" class="outline-3">
<h3 id="org2e22b67"><b>Tagless Final</b> is nothing but a fancy name of <b>ReaderT</b></h3>
<div class="outline-text-3" id="text-org2e22b67">
<p>
if we make some type alias for readerT, it's pretty much the same thing as the recent trending "design pattern" - <i>Tagless Final</i>
</p>
<pre class="code"><code> <span style="font-weight: bold;">trait</span> <span style="font-weight: bold; text-decoration: underline;">AlgInterp</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]] {
   <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">state</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>]
   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>(msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">Unit</span>]
   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">query</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>](c<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>]
 }

 <span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>], <span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">AlgInterp</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>], <span style="font-weight: bold; text-decoration: underline;">A</span>]

 <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">state</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>(<span style="font-weight: bold;">_</span>.state)
 <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]](msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">Unit</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Kleisli</span>(<span style="font-weight: bold;">_</span>.log(msg))

 <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">doobieQuery</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>], <span style="font-weight: bold; text-decoration: underline;">A</span>](query<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">A</span>]

 <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">program</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">Int</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
   env <span style="font-weight: bold;">&lt;-</span> state
   <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> log(s<span style="font-style: italic;">"initState is: </span><span style="font-weight: bold; font-style: italic;">$state</span><span style="font-style: italic;">"</span>)
   valueInDatabase <span style="font-weight: bold;">&lt;-</span> doobieQuery(sql<span style="font-style: italic;">"select 32"</span>.query[<span style="font-weight: bold; text-decoration: underline;">Int</span>].unique).handleError{<span style="font-weight: bold;">_=&gt;</span><span style="font-weight: bold; text-decoration: underline;">0</span>}
 } <span style="font-weight: bold;">yield</span> initState + valueInDatabase

<span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">interp</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">AlgInterp</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>]{
   <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">state</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(<span style="font-weight: bold; text-decoration: underline;">1</span>)
   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">log</span>(msg<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">String</span>) <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">IO</span>(getLogger.log(msg))
   <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">query</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>](c<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">ConnectionIO</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>]) <span style="font-weight: bold;">=</span> c.transact(xa)
 }
 program[<span style="font-weight: bold; text-decoration: underline;">IO</span>].run(interp).unsafeRunSync()
</code></pre>

<p>
If you look close enough, here it actually becomes 3 layers:
</p>
<ul class="org-ul">
<li>Layer 1: IO (AlgInterp)</li>
<li>Layer 2: IO ~&gt; Alg (state, log, doobieQuery)</li>
<li>Layer 3: Alg (program)</li>
</ul>

<p>
both layer 2 and 3 are pure, but the different is,
</p>
<ul class="org-ul">
<li>Layer 2 is just 1-1 mapping from IO to Alg</li>
<li>Layer 3 is orchestration of Layer 2 for pure business</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org495c5a4" class="outline-2">
<h2 id="org495c5a4">3 Layer Cake</h2>
<div class="outline-text-2" id="text-org495c5a4">
<p>
We now have a solid 3 Layer Scala Cake base made of <code>ReaderT</code>
</p>

<p>
But you know, single flavor of cake won't satisfy everyone's taste.
</p>
</div>
