org/scala/3-layer-cake.org
** The Needs of State
remember the 5 factors that compose our program?
1. Something to ask
2. Something to write
3. Some effects on dependencies
4. Some error to handle
5. Some business computation

It has a missing part - Some *state*!

In a 5 lines of code program, you won't see a state is necessary.

In the real world, there are so many scenario needed a state

i.e. a user's login info

supposed that our program has a middleware, controller, repository layer

Usually we will need to get user's info in middleware, and use the user info in repository layer for some database query.

So, here is the case, since I want a modular code base, so these 3 layers should not be just single =Alg[F]=, but 3

#+BEGIN_SRC scala
  def middleware[F[_]]: Alg[F, User] = ???
  def controller[F[_]]: Alg[F, Response] = ???
  def repository[F[_]](user: User): Alg[F, DBResult] = ???

  val program = for {
    user <- middleware
    dbresult <- respository(user)
    response <- controller
  } yield response
#+END_SRC

someday your controller become bigger and bigger and tech lead said there should be another layer - service, between controller and repository

#+BEGIN_SRC scala
  val program = for {
    user <- middleware
    dbresult <- service(user)
    response <- controller
  } yield response

  def service(user) = for {
    dbresult <- respository(user)
    result <- doSomthingWith(dbresult)
  } yield result
#+END_SRC
then it will become a nightmare that you have to pass such thing all over your code base.

But that's exactly State Monad solved, no matter how many State monad you split, every piece always can share the exactly same state.

#+BEGIN_SRC scala
  def middleware[F[_]]: StateT[F, User, Unit] = StateT.set[F, User](User("abc"))
  def controller[F[_]]: StateT[F, User, Response] = ???
  def repository[F[_]]: StateT[F, User, DBResult] = for {
    user <- StateT.get[F, User]
    dbResult <- findResourceInDB(user)
  } yield dbResult
#+END_SRC

So our program don't have to passing around user as parameter everywhere
#+BEGIN_SRC scala
  val program = for {
    _ <- middleware
    dbresult <- service
    response <- controller
  } yield response

  val service = for {
    dbresult <- respository
    result <- doSomthingWith(dbresult)
  } yield result
#+END_SRC

The new problem introduced by =StateT= is, everything else(controller, repository, service) need to be =StateT= as well. If we change them
to =StateT=, then we will lose the effects of =ReaderT=

