scala/3-layer-cake.html

<div id="outline-container-orgff372b6" class="outline-3">
<h3 id="orgff372b6">The Needs of State</h3>
<div class="outline-text-3" id="text-orgff372b6">
<p>
remember the 5 factors that compose our program?
</p>
<ol class="org-ol">
<li>Something to ask</li>
<li>Something to write</li>
<li>Some effects on dependencies</li>
<li>Some error to handle</li>
<li>Some business computation</li>
</ol>

<p>
It has a missing part - Some <b>state</b>!
</p>

<p>
In a 5 lines of code program, you won't see a state is necessary.
</p>

<p>
In the real world, there are so many scenario needed a state
</p>

<p>
i.e. a user's login info
</p>

<p>
supposed that our program has a middleware, controller, repository layer
</p>

<p>
Usually we will need to get user's info in middleware, and use the user info in repository layer for some database query.
</p>

<p>
So, here is the case, since I want a modular code base, so these 3 layers should not be just single <code>Alg[F]</code>, but 3
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">middleware</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>] <span style="font-weight: bold;">=</span> ???
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">controller</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">Response</span>] <span style="font-weight: bold;">=</span> ???
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">repository</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]](user<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">User</span>)<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">DBResult</span>] <span style="font-weight: bold;">=</span> ???

<span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">program</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  user <span style="font-weight: bold;">&lt;-</span> middleware
  dbresult <span style="font-weight: bold;">&lt;-</span> respository(user)
  response <span style="font-weight: bold;">&lt;-</span> controller
} <span style="font-weight: bold;">yield</span> response
</code></pre>

<p>
someday your controller become bigger and bigger and tech lead said there should be another layer - service, between controller and repository
</p>

<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">program</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  user <span style="font-weight: bold;">&lt;-</span> middleware
  dbresult <span style="font-weight: bold;">&lt;-</span> service(user)
  response <span style="font-weight: bold;">&lt;-</span> controller
} <span style="font-weight: bold;">yield</span> response

<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">service</span>(user) <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  dbresult <span style="font-weight: bold;">&lt;-</span> respository(user)
  result <span style="font-weight: bold;">&lt;-</span> doSomthingWith(dbresult)
} <span style="font-weight: bold;">yield</span> result
</code></pre>
<p>
then it will become a nightmare that you have to pass such thing all over your code base.
</p>

<p>
But that's exactly State Monad solved, no matter how many State monad you split, every piece always can share the exactly same state.
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">middleware</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>, <span style="font-weight: bold; text-decoration: underline;">Unit</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">StateT</span>.set[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>](<span style="font-weight: bold; text-decoration: underline;">User</span>(<span style="font-style: italic;">"abc"</span>))
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">controller</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>, <span style="font-weight: bold; text-decoration: underline;">Response</span>] <span style="font-weight: bold;">=</span> ???
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">repository</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>, <span style="font-weight: bold; text-decoration: underline;">DBResult</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  user <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">StateT</span>.get[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>]
  dbResult <span style="font-weight: bold;">&lt;-</span> findResourceInDB(user)
} <span style="font-weight: bold;">yield</span> dbResult
</code></pre>

<p>
So our program don't have to passing around user as parameter everywhere
</p>
<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">program</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> middleware
  dbresult <span style="font-weight: bold;">&lt;-</span> service
  response <span style="font-weight: bold;">&lt;-</span> controller
} <span style="font-weight: bold;">yield</span> response

<span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">service</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  dbresult <span style="font-weight: bold;">&lt;-</span> respository
  result <span style="font-weight: bold;">&lt;-</span> doSomthingWith(dbresult)
} <span style="font-weight: bold;">yield</span> result
</code></pre>

<p>
The new problem introduced by <code>StateT</code> is, everything else(controller, repository, service) need to be <code>StateT</code> as well. If we change them
to <code>StateT</code>, then we will lose the effects of <code>ReaderT</code>
</p>
</div>
</div>
