org/scala/3-layer-cake.org
** MTL
To able to use both =ReaderT= and =StateT=, [[https://typelevel.org/cats-mtl/][MTL]] [fn:4]is an elegant solution though.

MTL is like stacking those transformers together to =F=, at the end, you will get something very nice:

#+BEGIN_SRC scala
  def middleware[F[_]](implicit S: MonadState[F, User]): F[Unit] = S.set(User("abc"))
  def controller[F[_]]: F[Response] = ???
  def repository[F[_]](implicit S: MonadState[F, User]): F[DBResult] = for {
    user <- S.get
    dbResult <- findResourceInDB(user)
  } yield dbResult
#+END_SRC

Such DSL is nearly ideal, where

- if you look closer to =contorller='s type, it doesn't have any info about =User= or =MonadState=, because it shouldn't care about such things.
- =middleware= and =respository= connected to each other via the implicit instance of
=MonadState[F, User]=, which is perfect as well, no need to passing state around, request the implicit instance just in the place you need
it.

At the very end, provide the monad transformer stacks, so =F= is finally:

#+BEGIN_SRC scala
program[Alg[StateT[IO, User,? ], A]]
// which expended to..
program[ReaderT[StateT[IO, User,? ], AlgInterp[StateT[IO, User,? ]], A]]
#+END_SRC


There's no perfect solution for all, only perfect solution for particular case. For these example, MTL is perfect. But when you
have more effects, e.g. WriterT(to output something Monoid), EitherT(to provide MonadError) ... the MTL stack is not very easy to reason about, DSL is still nice though.

#+BEGIN_SRC scala
program[ReaderT[WriterT[StateT[IO, User,? ], Chain[String], ?], AlgInterp[WriterT[StateT[IO, User,? ], Chain[String], ?]], A]]
#+END_SRC

