scala/3-layer-cake.html

<div id="outline-container-orgbed6c47" class="outline-3">
<h3 id="orgbed6c47">MTL</h3>
<div class="outline-text-3" id="text-orgbed6c47">
<p>
To able to use both <code>ReaderT</code> and <code>StateT</code>, <a href="https://typelevel.org/cats-mtl/">MTL</a> <label for="1" class="margin-toggle sidenote-number"></label><input type="checkbox" id="1" class="margin-toggle"/><span class="sidenote">
Monad Transformer Library
</span>is an elegant solution though.
</p>

<p>
MTL is like stacking those transformers together to <code>F</code>, at the end, you will get something very nice:
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">middleware</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]](<span style="font-weight: bold;">implicit</span> <span style="font-weight: bold; text-decoration: underline;">S</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">MonadState</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">Unit</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">S</span>.set(<span style="font-weight: bold; text-decoration: underline;">User</span>(<span style="font-style: italic;">"abc"</span>))
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">controller</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]]<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">Response</span>] <span style="font-weight: bold;">=</span> ???
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">repository</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold;">_</span>]](<span style="font-weight: bold;">implicit</span> <span style="font-weight: bold; text-decoration: underline;">S</span><span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">MonadState</span>[<span style="font-weight: bold; text-decoration: underline;">F</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>])<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">F</span>[<span style="font-weight: bold; text-decoration: underline;">DBResult</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  user <span style="font-weight: bold;">&lt;-</span> <span style="font-weight: bold; text-decoration: underline;">S</span>.get
  dbResult <span style="font-weight: bold;">&lt;-</span> findResourceInDB(user)
} <span style="font-weight: bold;">yield</span> dbResult
</code></pre>

<p>
Such DSL is nearly ideal, where
</p>

<ul class="org-ul">
<li>if you look closer to <code>contorller</code>'s type, it doesn't have any info about <code>User</code> or <code>MonadState</code>, because it shouldn't care about such things.</li>
<li><code>middleware</code> and <code>respository</code> connected to each other via the implicit instance of</li>
</ul>
<p>
<code>MonadState[F, User]</code>, which is perfect as well, no need to passing state around, request the implicit instance just in the place you need
it.
</p>

<p>
At the very end, provide the monad transformer stacks, so <code>F</code> is finally:
</p>

<pre class="code"><code>program[<span style="font-weight: bold; text-decoration: underline;">Alg</span>[<span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>,? ], <span style="font-weight: bold; text-decoration: underline;">A</span>]]
<span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">which expended to..</span>
program[<span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>,? ], <span style="font-weight: bold; text-decoration: underline;">AlgInterp</span>[<span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>,? ]], <span style="font-weight: bold; text-decoration: underline;">A</span>]]
</code></pre>


<p>
There's no perfect solution for all, only perfect solution for particular case. For these example, MTL is perfect. But when you
have more effects, e.g. WriterT(to output something Monoid), EitherT(to provide MonadError) &#x2026; the MTL stack is not very easy to reason about, DSL is still nice though.
</p>

<pre class="code"><code>program[<span style="font-weight: bold; text-decoration: underline;">ReaderT</span>[<span style="font-weight: bold; text-decoration: underline;">WriterT</span>[<span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>,? ], <span style="font-weight: bold; text-decoration: underline;">Chain</span>[<span style="font-weight: bold; text-decoration: underline;">String</span>], ?], <span style="font-weight: bold; text-decoration: underline;">AlgInterp</span>[<span style="font-weight: bold; text-decoration: underline;">WriterT</span>[<span style="font-weight: bold; text-decoration: underline;">StateT</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, <span style="font-weight: bold; text-decoration: underline;">User</span>,? ], <span style="font-weight: bold; text-decoration: underline;">Chain</span>[<span style="font-weight: bold; text-decoration: underline;">String</span>], ?]], <span style="font-weight: bold; text-decoration: underline;">A</span>]]
</code></pre>
</div>
</div>
