org/scala/3-layer-cake.org
** Free Monad
Thus, the [[https://typelevel.org/cats/datatypes/freemonad.html][Free Monad]] will save your ass by providing monad for free if you have a Functor[fn:1].

The advantage of Free Monad is providing ability to create your own custom Monad Transformer, and it helps you stack them in a nicer way.

But let's try rewrite previous example first, since =State= and =Reader= are already data type, we could just stack(inject) them into a Free Monad.

#+BEGIN_SRC scala
import Free.{liftInject => free}
type Program[A] = EitherK[Reader[AlgoInterp[IO], ?], State[User, ?], A]
type ProgramF[A] = Free[Program, A]
#+END_SRC

Oh, since we have Free Monad, we don't need a reader monad to inject Interpreter, we can provide interpreter later for =foldMap=. 
Great, we save one effect then. Let's have another effect for demonstration i.e. Writer

#+BEGIN_SRC scala
type Program[A] = EitherK[Writer[Chain[String], ?], State[User, ?], A]
type ProgramF[A] = Free[Program, A]
#+END_SRC

Next you'll need to create two interpreters correspond to =Writer= and =State= effect.

#+BEGIN_SRC scala
def stateInterp(initState: User) = Lambda[State[User, ?] ~> IO[(Int, ?)]] { _.run(initState).value}
def writerInterp = Lambda[Writer[Chain[String], ?] ~> IO] { _.run(Chain.empty[String])}
#+END_SRC

#+BEGIN_SRC scala
  val program = for{
    initState <- free[Program](State.get[User])
    _ <- free[Program](Chain.one(s"init state: $initState").tell)
    _ <- free[Program](State.set(User("jcoy")))
    res <- free[Program](State.get[User])
    logs <- free[Program](Chain.one(s"next state: $res").tell)
  } yield (res, logs)
  program foldMap (writerInterp or stateInterp(User("anonymous")))
#+END_SRC
Guess what, the output will not be =User("jcoy")=, instead, =User("anounymous")=, also writer will only contain the second log.

Sorry I choose a bad example for Free Monad on purpose, in Monad Transformer, we need to run only once =StateT= or =WriterT= at
the end, thus the state maintained across all monads in program. But here each Free Monad in program will be mapped with interpreter.
So =State= and =Writer= run many times. Aach time they start with empty value in the interpreter.

Cats provide us [[https://typelevel.org/cats/datatypes/freemonad.html#freet][FreeT]] to cater such scenario, but again, transform one effect is OK, transfrom multiple effect is nightmare, it will bring the same
problem of Monad Transformer, then what's the whole point of using Free again?


** ReaderT + MTL + Free
Now that we know all approach has their own pros and cons, to eliminate their cons and magnify pros, the ultimate solution for
abstracting effects is *Why not all of them*

recall the 3 layers from ReaderT patter:

- Layer 1: IO (AlgInterp)
- Layer 2: IO ~> Alg (state, log, doobieQuery)
- Layer 3: Alg (program)

The ideal solution is to apply these approaches in different layers where they are good at.

Free Monad is good at providing nice DSL so it naturally serves well in Layer 3.

We also need MTL to transform some stateful effects in, so it's best place should be Layer 2, to provide various combination to provide
support for domain models.

Finally instead of interpreting Free Monad into IO directly, we can interpret Free Monad into ReaderT, so we get all pros from
ReaderT pattern to inject dependencies seamlessly.

To ultilize all these approaches together, we can use [[https://github.com/jcouyang/luci][luci]] to apply ReaderT, MTL and Free in the following 3 layer

- Layer 1: *Binary* =ReaderT[IO, Env, ?]=
- Layer 2: *Compiler* =Effects ~> ReaderT[IO, Env, ?]=
- Layer 3: *Program* =Free[Program, ?]=

Similar to a real world program, we need to go through the same 3 layer to execute our program:

1. write program in scala
2. compile scala code to binary(jar file)
3. run the jar in JVM with some parameters

But here we just keep doing the same thing to our EDSL[fn:2]

For demonstrating the power of ReaderT + MTL + Free, here we compose a program that contains all 6 factors:

1. Something to ask
2. Something to write
3. Some effects on dependencies
4. Some error to handle
5. Some business computation
6. Something stateful


