scala/3-layer-cake.html

<div id="outline-container-orgc2c1908" class="outline-3">
<h3 id="orgc2c1908">Free Monad</h3>
<div class="outline-text-3" id="text-orgc2c1908">
<p>
Thus, the <a href="https://typelevel.org/cats/datatypes/freemonad.html">Free Monad</a> will save your ass by providing monad for free if you have a Functor<label for="2" class="margin-toggle sidenote-number"></label><input type="checkbox" id="2" class="margin-toggle"/><span class="sidenote">
via <a href="https://blog.oyanglul.us/grokking-monad/scala/en/part3#orgd67ff11">CoYoneda Lema</a> you just need to provide a data type(case class) <code>F[A]</code>, and you will get Functor for free.
</span>.
</p>

<p>
The advantage of Free Monad is providing ability to create your own custom Monad Transformer, and it helps you stack them in a nicer way.
</p>

<p>
But let's try rewrite previous example first, since <code>State</code> and <code>Reader</code> are already data type, we could just stack(inject) them into a Free Monad.
</p>

<pre class="code"><code><span style="font-weight: bold;">import</span> <span style="font-weight: bold; text-decoration: underline;">Free</span>.{liftInject <span style="font-weight: bold;">=&gt;</span> free}
<span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">Program</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">EitherK</span>[<span style="font-weight: bold; text-decoration: underline;">Reader</span>[<span style="font-weight: bold; text-decoration: underline;">AlgoInterp</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>], ?], <span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">User</span>, ?], <span style="font-weight: bold; text-decoration: underline;">A</span>]
<span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">ProgramF</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Free</span>[<span style="font-weight: bold; text-decoration: underline;">Program</span>, <span style="font-weight: bold; text-decoration: underline;">A</span>]
</code></pre>

<p>
Oh, since we have Free Monad, we don't need a reader monad to inject Interpreter, we can provide interpreter later for <code>foldMap</code>. 
Great, we save one effect then. Let's have another effect for demonstration i.e. Writer
</p>

<pre class="code"><code><span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">Program</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">EitherK</span>[<span style="font-weight: bold; text-decoration: underline;">Writer</span>[<span style="font-weight: bold; text-decoration: underline;">Chain</span>[<span style="font-weight: bold; text-decoration: underline;">String</span>], ?], <span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">User</span>, ?], <span style="font-weight: bold; text-decoration: underline;">A</span>]
<span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">ProgramF</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Free</span>[<span style="font-weight: bold; text-decoration: underline;">Program</span>, <span style="font-weight: bold; text-decoration: underline;">A</span>]
</code></pre>

<p>
Next you'll need to create two interpreters correspond to <code>Writer</code> and <code>State</code> effect.
</p>

<pre class="code"><code><span style="font-weight: bold;">def</span> <span style="font-weight: bold;">stateInterp</span>(initState<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">User</span>) <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Lambda</span>[<span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">User</span>, ?] ~&gt; <span style="font-weight: bold; text-decoration: underline;">IO</span>[(<span style="font-weight: bold; text-decoration: underline;">Int</span>, ?)]] { <span style="font-weight: bold;">_</span>.run(initState).value}
<span style="font-weight: bold;">def</span> <span style="font-weight: bold;">writerInterp</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Lambda</span>[<span style="font-weight: bold; text-decoration: underline;">Writer</span>[<span style="font-weight: bold; text-decoration: underline;">Chain</span>[<span style="font-weight: bold; text-decoration: underline;">String</span>], ?] ~&gt; <span style="font-weight: bold; text-decoration: underline;">IO</span>] { <span style="font-weight: bold;">_</span>.run(<span style="font-weight: bold; text-decoration: underline;">Chain</span>.empty[<span style="font-weight: bold; text-decoration: underline;">String</span>])}
</code></pre>

<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">program</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span>{
  initState <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">State</span>.get[<span style="font-weight: bold; text-decoration: underline;">User</span>])
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">Chain</span>.one(s<span style="font-style: italic;">"init state: </span><span style="font-weight: bold; font-style: italic;">$initState</span><span style="font-style: italic;">"</span>).tell)
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">State</span>.set(<span style="font-weight: bold; text-decoration: underline;">User</span>(<span style="font-style: italic;">"jcoy"</span>)))
  res <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">State</span>.get[<span style="font-weight: bold; text-decoration: underline;">User</span>])
  logs <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">Chain</span>.one(s<span style="font-style: italic;">"next state: </span><span style="font-weight: bold; font-style: italic;">$res</span><span style="font-style: italic;">"</span>).tell)
} <span style="font-weight: bold;">yield</span> (res, logs)
program foldMap (writerInterp or stateInterp(<span style="font-weight: bold; text-decoration: underline;">User</span>(<span style="font-style: italic;">"anonymous"</span>)))
</code></pre>
<p>
Guess what, the output will not be <code>User("jcoy")</code>, instead, <code>User("anounymous")</code>, also writer will only contain the second log.
</p>

<p>
Sorry I choose a bad example for Free Monad on purpose, in Monad Transformer, we need to run only once <code>StateT</code> or <code>WriterT</code> at
the end, thus the state maintained across all monads in program. But here each Free Monad in program will be mapped with interpreter.
So <code>State</code> and <code>Writer</code> run many times. Aach time they start with empty value in the interpreter.
</p>

<p>
Cats provide us <a href="https://typelevel.org/cats/datatypes/freemonad.html#freet">FreeT</a> to cater such scenario, but again, transform one effect is OK, transfrom multiple effect is nightmare, it will bring the same
problem of Monad Transformer, then what's the whole point of using Free again?
</p>
</div>
</div>


<div id="outline-container-org01afbc4" class="outline-3">
<h3 id="org01afbc4">ReaderT + MTL + Free</h3>
<div class="outline-text-3" id="text-org01afbc4">
<p>
Now that we know all approach has their own pros and cons, to eliminate their cons and magnify pros, the ultimate solution for
abstracting effects is <b>Why not all of them</b>
</p>

<p>
recall the 3 layers from ReaderT patter:
</p>

<ul class="org-ul">
<li>Layer 1: IO (AlgInterp)</li>
<li>Layer 2: IO ~&gt; Alg (state, log, doobieQuery)</li>
<li>Layer 3: Alg (program)</li>
</ul>

<p>
The ideal solution is to apply these approaches in different layers where they are good at.
</p>

<p>
Free Monad is good at providing nice DSL so it naturally serves well in Layer 3.
</p>

<p>
We also need MTL to transform some stateful effects in, so it's best place should be Layer 2, to provide various combination to provide
support for domain models.
</p>

<p>
Finally instead of interpreting Free Monad into IO directly, we can interpret Free Monad into ReaderT, so we get all pros from
ReaderT pattern to inject dependencies seamlessly.
</p>

<p>
To ultilize all these approaches together, we can use <a href="https://github.com/jcouyang/luci">luci</a> to apply ReaderT, MTL and Free in the following 3 layer
</p>

<ul class="org-ul">
<li>Layer 1: <b>Binary</b> <code>ReaderT[IO, Env, ?]</code></li>
<li>Layer 2: <b>Compiler</b> <code>Effects ~&gt; ReaderT[IO, Env, ?]</code></li>
<li>Layer 3: <b>Program</b> <code>Free[Program, ?]</code></li>
</ul>

<p>
Similar to a real world program, we need to go through the same 3 layer to execute our program:
</p>

<ol class="org-ol">
<li>write program in scala</li>
<li>compile scala code to binary(jar file)</li>
<li>run the jar in JVM with some parameters</li>
</ol>

<p>
But here we just keep doing the same thing to our EDSL<label for="3" class="margin-toggle sidenote-number"></label><input type="checkbox" id="3" class="margin-toggle"/><span class="sidenote">
Embedded Domain Specific Language
</span>
</p>

<p>
For demonstrating the power of ReaderT + MTL + Free, here we compose a program that contains all 6 factors:
</p>

<ol class="org-ol">
<li>Something to ask</li>
<li>Something to write</li>
<li>Some effects on dependencies</li>
<li>Some error to handle</li>
<li>Some business computation</li>
<li>Something stateful</li>
</ol>
</div>
