org/scala/3-layer-cake.org
*** Layer 3: Business (Free)
to create a EDSL for Business, just use the Effects
#+BEGIN_SRC scala
  val program = for {
    // 1. Somthing to read
    config <- free[Program](Reader(identity[Config]))
    // 2. Something to write
    _ <- free[Program]((Chain.one("config: " + config.token)).tell)
    // 3. Some effects on dependencies
    response <- free[Program](
      GetStatus[IO](GET(Uri.uri("https://blog.oyanglul.us"))))
    // 4. Some error to handle, response is Either[Throwable, Response[IO]], hence MonadError instance
    _ <- free[Program](response.ensure(new Exception("oops my website is down"))(_.status == Status.Ok))
    // 6. Something stateful
    _ <- free[Program](State.modify[Int](1 + _))
    state <- free[Program](State.modify[Int](1 + _))
  } yield state
#+END_SRC

from here we can easily tell that =Program= should contain following effects:

#+BEGIN_SRC scala
type Program[A] = Eff5[
      Http4sClient[IO, ?],
      Writer[Chain[String], ?],
      Reader[Config, ?],
      State[Int, ?],
      Either[Throwable, ?],
      A
    ]
#+END_SRC

=EffX= is predefined alias of type to construct multiple kind in EitherK in luci.

This is the Layer 3, which only has business DSL no IO[fn:3] thanks to the *Abstraction Barrier* provided by Layer 2.
 
*** Layer 2: MTL + Interpreter

Layer 2 is like a VM, it connects the business and bare metal, here we can deal with stateful effect with transformer

i.e. the state compiler
#+BEGIN_SRC scala
  implicit def stateCompiler[L](implicit ev: Monad[E]) =
    new Compiler[State[L, ?], E] {
      type Env = MonadState[E, L] :: HNil
      val compile = Lambda[State[L, ?] ~> Bin](state =>
        ReaderT(env =>
          for {
            currentState <- env.head.get
            (nextState, value) = state.run(currentState).value
            _ <- env.head.set(nextState)
          } yield value))
    }
#+END_SRC

the original MTL way is to implicitly find =MonadState= from context

#+BEGIN_SRC diff
  - implicit def stateCompiler[L](implicit ev: Monad[E]) =
  + implicit def stateCompiler[L](implicit ev: Monad[E], S: MonadState[E, L]) =
      new Compiler[State[L, ?], E] {
  -     type Env = MonadState[E, L] :: HNil
        val compile = Lambda[State[L, ?] ~> Bin](state =>
          ReaderT(env =>
            for {
  -           currentState <- env.head.get
  +           currentState <- S.get
              (nextState, value) = state.run(currentState).value
  -           _ <- env.head.set(nextState)
  +           _ <- S.set(nextState)            
            } yield value))
      }
#+END_SRC

But since we have ReaderT, I'll prefer 
explicitly inject =MonadState= to have everything explicitly managed in one place.

