scala/3-layer-cake.html


<div id="outline-container-org1a8b4cd" class="outline-4">
<h4 id="org1a8b4cd">Layer 3: Business (Free)</h4>
<div class="outline-text-4" id="text-org1a8b4cd">
<p>
to create a EDSL for Business, just use the Effects
</p>
<pre class="code"><code><span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">program</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold;">for</span> {
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">1. Somthing to read</span>
  config <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">Reader</span>(identity[<span style="font-weight: bold; text-decoration: underline;">Config</span>]))
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">2. Something to write</span>
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>]((<span style="font-weight: bold; text-decoration: underline;">Chain</span>.one(<span style="font-style: italic;">"config: "</span> + config.token)).tell)
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">3. Some effects on dependencies</span>
  response <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](
    <span style="font-weight: bold; text-decoration: underline;">GetStatus</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>](<span style="font-weight: bold; text-decoration: underline;">GET</span>(<span style="font-weight: bold; text-decoration: underline;">Uri</span>.uri(<span style="font-style: italic;">"https://blog.oyanglul.us"</span>))))
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">4. Some error to handle, response is Either[Throwable, Response[IO]], hence MonadError instance</span>
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](response.ensure(<span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Exception</span>(<span style="font-style: italic;">"oops my website is down"</span>))(<span style="font-weight: bold;">_</span>.status == <span style="font-weight: bold; text-decoration: underline;">Status</span>.<span style="font-weight: bold; text-decoration: underline;">Ok</span>))
  <span style="font-weight: bold; font-style: italic;">// </span><span style="font-weight: bold; font-style: italic;">6. Something stateful</span>
  <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">State</span>.modify[<span style="font-weight: bold; text-decoration: underline;">Int</span>](<span style="font-weight: bold; text-decoration: underline;">1</span> + <span style="font-weight: bold;">_</span>))
  state <span style="font-weight: bold;">&lt;-</span> free[<span style="font-weight: bold; text-decoration: underline;">Program</span>](<span style="font-weight: bold; text-decoration: underline;">State</span>.modify[<span style="font-weight: bold; text-decoration: underline;">Int</span>](<span style="font-weight: bold; text-decoration: underline;">1</span> + <span style="font-weight: bold;">_</span>))
} <span style="font-weight: bold;">yield</span> state
</code></pre>

<p>
from here we can easily tell that <code>Program</code> should contain following effects:
</p>

<pre class="code"><code><span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">Program</span>[<span style="font-weight: bold; text-decoration: underline;">A</span>] <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Eff5</span>[
      <span style="font-weight: bold; text-decoration: underline;">Http4sClient</span>[<span style="font-weight: bold; text-decoration: underline;">IO</span>, ?],
      <span style="font-weight: bold; text-decoration: underline;">Writer</span>[<span style="font-weight: bold; text-decoration: underline;">Chain</span>[<span style="font-weight: bold; text-decoration: underline;">String</span>], ?],
      <span style="font-weight: bold; text-decoration: underline;">Reader</span>[<span style="font-weight: bold; text-decoration: underline;">Config</span>, ?],
      <span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">Int</span>, ?],
      <span style="font-weight: bold; text-decoration: underline;">Either</span>[<span style="font-weight: bold; text-decoration: underline;">Throwable</span>, ?],
      <span style="font-weight: bold; text-decoration: underline;">A</span>
    ]
</code></pre>

<p>
<code>EffX</code> is predefined alias of type to construct multiple kind in EitherK in luci.
</p>

<p>
This is the Layer 3, which only has business DSL no IO<label for="4" class="margin-toggle sidenote-number"></label><input type="checkbox" id="4" class="margin-toggle"/><span class="sidenote">
Http4sClient is exception since the effect itself is a Tagless Final
</span> thanks to the <b>Abstraction Barrier</b> provided by Layer 2.
</p>
</div>
</div>

<div id="outline-container-orgf0220b3" class="outline-4">
<h4 id="orgf0220b3">Layer 2: MTL + Interpreter</h4>
<div class="outline-text-4" id="text-orgf0220b3">
<p>
Layer 2 is like a VM, it connects the business and bare metal, here we can deal with stateful effect with transformer
</p>

<p>
i.e. the state compiler
</p>
<pre class="code"><code><span style="font-weight: bold;">implicit</span> <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">stateCompiler</span>[<span style="font-weight: bold; text-decoration: underline;">L</span>](<span style="font-weight: bold;">implicit</span> ev<span style="font-weight: bold;">:</span> <span style="font-weight: bold; text-decoration: underline;">Monad</span>[<span style="font-weight: bold; text-decoration: underline;">E</span>]) <span style="font-weight: bold;">=</span>
  <span style="font-weight: bold;">new</span> <span style="font-weight: bold; text-decoration: underline;">Compiler</span>[<span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">L</span>, ?], <span style="font-weight: bold; text-decoration: underline;">E</span>] {
    <span style="font-weight: bold;">type</span> <span style="font-weight: bold; text-decoration: underline;">Env</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">MonadState</span>[<span style="font-weight: bold; text-decoration: underline;">E</span>, <span style="font-weight: bold; text-decoration: underline;">L</span>] :: <span style="font-weight: bold; text-decoration: underline;">HNil</span>
    <span style="font-weight: bold;">val</span> <span style="font-weight: bold; font-style: italic;">compile</span> <span style="font-weight: bold;">=</span> <span style="font-weight: bold; text-decoration: underline;">Lambda</span>[<span style="font-weight: bold; text-decoration: underline;">State</span>[<span style="font-weight: bold; text-decoration: underline;">L</span>, ?] ~&gt; <span style="font-weight: bold; text-decoration: underline;">Bin</span>](state <span style="font-weight: bold;">=&gt;</span>
      <span style="font-weight: bold; text-decoration: underline;">ReaderT</span>(env <span style="font-weight: bold;">=&gt;</span>
        <span style="font-weight: bold;">for</span> {
          currentState <span style="font-weight: bold;">&lt;-</span> env.head.get
          (nextState, value) <span style="font-weight: bold;">=</span> state.run(currentState).value
          <span style="font-weight: bold;">_</span> <span style="font-weight: bold;">&lt;-</span> env.head.set(nextState)
        } <span style="font-weight: bold;">yield</span> value))
  }
</code></pre>

<p>
the original MTL way is to implicitly find <code>MonadState</code> from context
</p>

<pre class="code"><code>- implicit def stateCompiler[L](implicit ev: Monad[E]) =
+ implicit def stateCompiler[L](implicit ev: Monad[E], S: MonadState[E, L]) =
    new Compiler[State[L, ?], E] {
-     type Env = MonadState[E, L] :: HNil
      val compile = Lambda[State[L, ?] ~&gt; Bin](state =&gt;
        ReaderT(env =&gt;
          for {
-           currentState &lt;- env.head.get
+           currentState &lt;- S.get
            (nextState, value) = state.run(currentState).value
-           _ &lt;- env.head.set(nextState)
+           _ &lt;- S.set(nextState)            
          } yield value))
    }
</code></pre>

<p>
But since we have ReaderT, I'll prefer 
explicitly inject <code>MonadState</code> to have everything explicitly managed in one place.
</p>
</div>
</div>
